zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE32B/startup_MCXE32B_cm7_core1.cpp
WEAK void FlexCAN2_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(2U, 32U, 63U);
}

WEAK void FlexCAN3_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(3U);
}

WEAK void FlexCAN3_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(3U, 0U, 31U);
}

WEAK void FlexCAN4_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(4U);
}

WEAK void FlexCAN4_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(4U, 0U, 31U);
}

WEAK void FlexCAN5_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(5U);
}

WEAK void FlexCAN5_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(5U, 0U, 31U);
}

WEAK void Reserved141_IRQHandler(void)
{
    Reserved141_DriverIRQHandler();
}

WEAK void Reserved142_IRQHandler(void)
{
    Reserved142_DriverIRQHandler();
}

WEAK void Reserved143_IRQHandler(void)
{
    Reserved143_DriverIRQHandler();
}

WEAK void Reserved144_IRQHandler(void)
{
    Reserved144_DriverIRQHandler();
}

WEAK void Reserved145_IRQHandler(void)
{
    Reserved145_DriverIRQHandler();
}

WEAK void Reserved146_IRQHandler(void)
{
    Reserved146_DriverIRQHandler();
}

WEAK void Reserved147_IRQHandler(void)
{
    Reserved147_DriverIRQHandler();
}

WEAK void Reserved148_IRQHandler(void)
{
    Reserved148_DriverIRQHandler();
}

WEAK void Reserved149_IRQHandler(void)
{
    Reserved149_DriverIRQHandler();
}

WEAK void Reserved150_IRQHandler(void)
{
    Reserved150_DriverIRQHandler();
}

WEAK void Reserved151_IRQHandler(void)
{
    Reserved151_DriverIRQHandler();
}

WEAK void Reserved152_IRQHandler(void)
{
    Reserved152_DriverIRQHandler();
}

WEAK void Reserved153_IRQHandler(void)
{
    Reserved153_DriverIRQHandler();
}

WEAK void Reserved154_IRQHandler(void)
{
    Reserved154_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void Reserved156_IRQHandler(void)
{
    Reserved156_DriverIRQHandler();
}

WEAK void LPUART_0_IRQHandler(void)
{
    LPUART_DriverIRQHandler(0U);
}

WEAK void LPUART_1_IRQHandler(void)
{
    LPUART_DriverIRQHandler(1U);
}

WEAK void LPUART_2_IRQHandler(void)
{
    LPUART_DriverIRQHandler(2U);
}

WEAK void LPUART_3_IRQHandler(void)
{
    LPUART_DriverIRQHandler(3U);
}

WEAK void LPUART_4_IRQHandler(void)
{
    LPUART_DriverIRQHandler(4U);
}

WEAK void LPUART_5_IRQHandler(void)
{
    LPUART_DriverIRQHandler(5U);
}

WEAK void LPUART_6_IRQHandler(void)
{
    LPUART_DriverIRQHandler(6U);
}

WEAK void LPUART_7_IRQHandler(void)
{
    LPUART_DriverIRQHandler(7U);
}

WEAK void LPUART_8_IRQHandler(void)
{
    LPUART_DriverIRQHandler(8U);
}

WEAK void LPUART_9_IRQHandler(void)
{
    LPUART_DriverIRQHandler(9U);
}

WEAK void LPUART_10_IRQHandler(void)
{
    LPUART_DriverIRQHandler(10U);
}

WEAK void LPUART_11_IRQHandler(void)
{
    LPUART_DriverIRQHandler(11U);
}

WEAK void LPUART_12_IRQHandler(void)
{
    LPUART_DriverIRQHandler(12U);
}

WEAK void LPUART_13_IRQHandler(void)
{
    LPUART_DriverIRQHandler(13U);
}

WEAK void LPUART_14_IRQHandler(void)
{
    LPUART_DriverIRQHandler(14U);
}

WEAK void LPUART_15_IRQHandler(void)
{
    LPUART_DriverIRQHandler(15U);
}

WEAK void Reserved173_IRQHandler(void)
{
    Reserved173_DriverIRQHandler();
}

WEAK void Reserved174_IRQHandler(void)
{
    Reserved174_DriverIRQHandler();
}

WEAK void Reserved175_IRQHandler(void)
{
    Reserved175_DriverIRQHandler();
}

WEAK void Reserved176_IRQHandler(void)
{
    Reserved176_DriverIRQHandler();
}

WEAK void LPI2C0_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(0U);
}

WEAK void LPI2C1_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(1U);
}

WEAK void Reserved179_IRQHandler(void)
{
    Reserved179_DriverIRQHandler();
}

WEAK void Reserved180_IRQHandler(void)
{
    Reserved180_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(0U);
}

WEAK void LPSPI1_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(1U);
}

WEAK void LPSPI2_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(2U);
}

WEAK void LPSPI3_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(3U);
}

WEAK void LPSPI4_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(4U);
}

WEAK void LPSPI5_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(5U);
}

WEAK void Reserved187_IRQHandler(void)
{
    Reserved187_DriverIRQHandler();
}

WEAK void Reserved188_IRQHandler(void)
{
    Reserved188_DriverIRQHandler();
}

WEAK void QSPI_IRQHandler(void)
{
    QSPI_DriverIRQHandler();
}

WEAK void SAI0_IRQHandler(void)
{
    SAI_DriverIRQHandler(0U);
}

WEAK void SAI1_IRQHandler(void)
{
    SAI_DriverIRQHandler(1U);
}

WEAK void Reserved192_IRQHandler(void)
{
    Reserved192_DriverIRQHandler();
}

WEAK void Reserved193_IRQHandler(void)
{
    Reserved193_DriverIRQHandler();
}

WEAK void JDC_IRQHandler(void)
{
    JDC_DriverIRQHandler();
}

WEAK void Reserved195_IRQHandler(void)
{
    Reserved195_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{
    ADC2_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
    CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
    CMP1_DriverIRQHandler();
}

WEAK void CMP2_IRQHandler(void)
{
    CMP2_DriverIRQHandler();
}

WEAK void Reserved202_IRQHandler(void)
{
    Reserved202_DriverIRQHandler();
}

WEAK void Reserved203_IRQHandler(void)
{
    Reserved203_DriverIRQHandler();
}

WEAK void Reserved204_IRQHandler(void)
{
    Reserved204_DriverIRQHandler();
}

WEAK void FCCU_0_IRQHandler(void)
{
    FCCU_0_DriverIRQHandler();
}

WEAK void FCCU_1_IRQHandler(void)
{
    FCCU_1_DriverIRQHandler();
}

WEAK void STCU_IRQHandler(void)
{
    STCU_DriverIRQHandler();
}

WEAK void MU0_B_TX_IRQHandler(void)
{
    MU0_B_TX_DriverIRQHandler();
}

WEAK void MU0_B_RX_IRQHandler(void)
{
    MU0_B_RX_DriverIRQHandler();
}

WEAK void MU0_B_IRQHandler(void)
{
    MU0_B_DriverIRQHandler();
}

WEAK void MU1_B_TX_IRQHandler(void)
{
    MU1_B_TX_DriverIRQHandler();
}

WEAK void MU1_B_RX_IRQHandler(void)
{
    MU1_B_RX_DriverIRQHandler();
}

WEAK void MU1_B_IRQHandler(void)
{
    MU1_B_DriverIRQHandler();
}

WEAK void Reserved214_IRQHandler(void)
{
    Reserved214_DriverIRQHandler();
}

